///** @file
//
//Copyright (c) 2006 - 2019, Byosoft Corporation.<BR> 
//All rights reserved.This software and associated documentation (if any)
//is furnished under a license and may only be used or copied in 
//accordance with the terms of the license. Except as permitted by such
//license, no part of this software or documentation may be reproduced, 
//stored in a retrieval system, or transmitted in any form or by any 
//means without the express written consent of Byosoft Corporation.
//
//File Name:
//  HddPasswordStrings.uni
//
//Abstract: 
//  uni file for Hdd password DXE driver.
//
//Revision History:
//
//**/

/=#
#langdef   zh-Hans "\wide中文\narrow"
#langdef   en-US "English"

#string STR_DRIVE_LOCK			      #language en-US   "Hdd Password"
                                  #language zh-Hans "\wide硬盘密码\narrow"
#string STR_DRIVE_LOCK_HELP			  #language en-US   "Hdd Password"
                                  #language zh-Hans "\wide硬盘密码\narrow"                                  
                                
                                  
#string HP_STR_PW_NOTICE                                         #language en-US   "Setup Notice"
                                                                 #language zh-Hans "\wide密码设定通知\narrow"
#string HP_STR_CHANGES_SAVED                                     #language en-US   "Changes have been saved"
                                                                 #language zh-Hans "\wide密码修改已保存\narrow"
#string HP_STR_CONTINUE                                          #language en-US   "[Continue]"
                                                                 #language zh-Hans "\wide继续\narrow"
#string HP_STR_PW_WARNING                                        #language en-US   "Setup Warning"
                                                                 #language zh-Hans "\wide密码设定警告\narrow"
#string HP_STR_PW_NOT_MATCH                                      #language en-US   "Passwords are not the same"
                                                                 #language zh-Hans "\wide密码不符，两次输入的密码必须相同\narrow"
#string HP_STR_PW_ENTER_TO_CONTINUE                              #language en-US   "Press ENTER to continue"
                                                                 #language zh-Hans "\wide按\narrowEnter\wide键继续\narrow"
#string HP_STR_PW_INVALID_PW                                     #language en-US   "Invalid Password"
                                                                 #language zh-Hans "\wide密码无效\narrow"
#string HP_STR_PW_INVALID_LEN                                    #language en-US   "Invalid Password Length"
                                                                 #language zh-Hans "\wide密码长度无效\narrow"                                                                 
#string HP_STR_PW_INVALID_CHARA                                  #language en-US   "Invalid Password Charater Type"
                                                                 #language zh-Hans "\wide密码字符类型无效\narrow"    
                                                                                                                                  
#string HP_STR_OP_FAIL                                           #language en-US   "operation failed"
                                                                 #language zh-Hans "\wide操作失败\narrow"                                  
#string HP_STR_HDD_FROZEN                                        #language en-US   "Device is frozen，please power off then restart to try again."
                                                                 #language zh-Hans "\wide设备处于冻结状态，请关机并重启后重试。\narrow"                                  
                                  
#string STR_ENTER_HDP                                            #language en-US   "Enter Hdd Password"
                                                                 #language zh-Hans "\wide输入\narrowHdd\wide密码\narrow"                                  
#string STR_WRONG_PWD_TRY_AGAIN                                  #language en-US   "Incorrect password. Please try again."
                                                                 #language zh-Hans "\wide密码错误，请重试\narrow"
#string STR_NEED_HDP                                             #language en-US   "Please restart and enter the correct password to unlock the locked HDD."
                                                                 #language zh-Hans "\wide请重启并输入正确的密码才可以解开锁住的硬盘\narrow"
//#string STR_NEED_HDP2                                            #language en-US   "Please restart"
//                                                                 #language zh-Hans "\wide请重启\narrow"
#string STR_HDP_CANCEL                                           #language en-US   "Password input cancelled, Drive is still locked."
                                                                 #language zh-Hans "\wide密码输入已取消，驱动器仍处于锁定状态。\narrow"


#string STR_HDP_WARN1                                            #language en-US   "Please exercise caution when using Hdd Password."
                                                                 #language zh-Hans "\wide请谨慎使用硬盘密码功能，\narrow"
#string STR_HDP_WARN2                                            #language en-US   "Losting the passwords will render a drive permanently unusable."
                                                                 #language zh-Hans "\wide忘记密码后驱动器将永远无法使用。\narrow"
#string STR_HDP_WARN3                                            #language en-US   "Please be aware these settings take place immediately: save not necessary."
                                                                 #language zh-Hans "\wide设定立即生效，不需要保存。\narrow"
                                                                 
#string STR_NULL                                                 #language en-US   ""
                                                                 #language zh-Hans ""                                                                 
                                                                 
#string STR_PRESS_ENTER_SHUTDOWN                                 #language en-US   "Press ENTER to shutdown"
                                                                 #language zh-Hans "\wide按\narrowENTER\wide键关机\narrow"

#string STR_HDD_NAME                                             #language en-US   ""
                                                                 #language zh-Hans "" 

#string STR_HDD_PASSWORD_INSTALL                                 #language en-US   "Set hard disk password:Installed"
                                                                 #language zh-Hans "\wide设置硬盘密码\narrow:\wide已安装\narrow" 

#string STR_HDD_PASSWORD_NOT_INSTALL                             #language en-US   "Set hard disk password:Not Installed"
                                                                 #language zh-Hans "\wide设置硬盘密码\narrow:\wide未安装\narrow" 



#string HP_STR_EN_USER_PW                                        #language en-US   "Enable Hdd Password"
                                                                 #language zh-Hans "\wide启用硬盘密码\narrow" 
#string HP_STR_EN_USER_PW_HELP                                   #language en-US   "Set and enable the hard drive password.\n\nLetters, numbers and special printable characters are supported. Passwords are case sensitive. The password must contains both numbers and letters. The limited length of password string is 8 to 20."
                                                                 #language zh-Hans "\wide设置并启用硬盘密码。\narrow\n\n\wide密码支持字符包括字母、数字以及其它可打印字符。密码区分大小写，密码必须同时包含数字和字母。支持输入密码长度为\narrow8\wide到\narrow20\wide。\narrow" 


#string HP_STR_DIS_USER_PW                                       #language en-US   "Disable Hdd Password"
                                                                 #language zh-Hans "\wide禁用硬盘密码\narrow" 
#string HP_STR_DIS_USER_PW_HELP                                  #language en-US   "Enter existing password, and then disables Hdd Password."
                                                                 #language zh-Hans "\wide输入现有密码，然后禁用硬盘密码\narrow" 

#string HP_STR_CH_USER_PW                                        #language en-US   "Change Hdd Password User Password."
                                                                 #language zh-Hans "\wide更改硬盘密码\narrow" 
#string HP_STR_CH_USER_PW_HELP                                   #language en-US   "Changes the drive's User password. Hdd Password remains enabled.\n\nLetters, numbers and special printable characters are supported. Passwords are case sensitive. The password must contains both numbers and letters. The limited length of password string is 8 to 20."
                                                                 #language zh-Hans "\wide更改密码，硬盘密码保持启用。\narrow\n\n\wide密码支持字符包括字母、数字以及特殊可打印字符。密码区分大小写，密码必须同时包含数字和字母。支持输入密码长度为8到20。\narrow" 
#string HP_STR_SET_MASTER_PW                                     #language en-US   "Set Hdd Password Master Password"
                                                                 #language zh-Hans "\wide设置硬盘密码主密码\narrow" 
#string HP_STR_SET_MASTER_PW_HELP                                #language en-US   "Sets the drive's Master password only, but it does not enable Hdd Password. If you want to set and enable the hard disk password, you don't need to set this item and directly set the next item."
                                                                 #language zh-Hans "\wide仅设置驱动器主密码，但不启用硬盘密码。若要设置并启用硬盘密码，此项可以不设置，直接设置下一项。\narrow"                                                                  

#string HP_STR_CH_MASTER_PW                                      #language en-US   "Change Hdd Password Master Password"
                                                                 #language zh-Hans "\wide更改硬盘密码\wide主密码\narrow" 
#string HP_STR_CH_MASTER_PW_HELP                                 #language en-US   "Changes the drive's Master password. Hdd Password remains enabled"
                                                                 #language zh-Hans "\wide更改驱动器主密码，硬盘密码保持启用。\narrow" 

#string HP_STR_CH_ADMIN_PW                                       #language en-US   "Change Hdd Password Administrator Password"
                                                                 #language zh-Hans "\wide更改硬盘密码\narrow" 
#string HP_STR_CH_ADMIN_PW_HELP                                  #language en-US   "Changes the drive's Administrator password. Hdd Password remains enabled"
                                                                 #language zh-Hans "\wide更改硬盘密码，硬盘密码保持启用。\narrow" 
                                                                 
                                                                 
#string STR_HDP_LOCK_WARN1                                       #language en-US   "The hard drive's security state cannot be changed."
                                                                 #language zh-Hans "\wide无法更改驱动器的安全状态。\narrow"
#string STR_HDP_LOCK_WARN2                                       #language en-US   "Cycle power to manage Hdd Password on this drive"
                                                                 #language zh-Hans "\wide请重启以在此驱动器上管理硬盘密码\narrow"

#string STR_HDP_CHOICE_DRIVE                                     #language en-US   "Select a Drive"
                                                                 #language zh-Hans "\wide选择驱动器\narrow"
                                                                 
#string STR_HDP_COUNT_OUT1                                       #language en-US   "This drive can no longer be unlocked until power is cycled. Press a key to continue."
                                                                 #language zh-Hans "\wide只有通过断电后重新接通电源才能解锁驱动器。按任意键继续。\narrow"
#string STR_HDP_COUNT_OUT2                                       #language en-US   "Continue booting with this drive locked."
                                                                 #language zh-Hans "\wide继续在此驱动器锁定的情况下进行引导。\narrow"
#string HP_STR_EN_ADMIN_PW                                       #language en-US   "Enable Hdd Password"
                                                                 #language zh-Hans "\wide启用硬盘密码\narrow" 
#string HP_STR_EN_ADMIN_PW_HELP                                  #language en-US   "Sets the drive's Administrator Password and enables Hdd Password."
                                                                 #language zh-Hans "\wide启用硬盘密码。设置并启用硬盘密码\narrow"

#string HP_STR_INPUT_PSW                                         #language en-US   "Enter Hdd Password Password"
                                                                 #language zh-Hans "\wide请输入硬盘密码\narrow"                                                                  
#string HP_STR_INPUT_NEW_ADMIN_PSW                               #language en-US   "Enter new Hdd Password Administrator Password"
                                                                 #language zh-Hans "\wide请输入新的硬盘管理员密码\narrow"                                                                  
#string HP_STR_INPUT_CUR_ADMIN_PSW                               #language en-US   "Enter current Hdd Password Administrator Password"
                                                                 #language zh-Hans "\wide请输入当前硬盘管理员密码\narrow"                                                                  
#string HP_STR_INPUT_ADMIN_PSW                                   #language en-US   "Enter Hdd Password Administrator Password"
                                                                 #language zh-Hans "\wide请输入硬盘管理员密码\narrow"                                                                  
#string HP_STR_NVME_CH_USER_PW_HELP                              #language en-US   "Changes the drive's User password. Hdd Password remains enabled. If User password does not set before, current password is same as Administrator password."
                                                                 #language zh-Hans "\wide更改驱动器的用户密码，硬盘密码保持启用。如果之前没有设置过用户密码，当前用户密码和管理员密码一样。\narrow"                                                                  

#string HP_STR_SATA_INPUT_USER_PSW                               #language en-US   "Enter Hdd Password User Password"
                                                                 #language zh-Hans "\wide请输入硬盘用户密码\narrow"  
#string HP_STR_SATA_INPUT_MASTER_PSW                             #language en-US   "Enter Hdd Password Master Password"
                                                                 #language zh-Hans "\wide请输入硬盘主密码\narrow"   













                                                                 
